In [15]:
import pandas as pd
import sqlalchemy as sqlac
import mysql.connector

In [16]:
dbku = mysql.connector.connect(
host = 'localhost',
user = 'root',
passwd = '12344321',
database = 'ptbaru')
query = 'select * from employees'
# alamatDB = 'mysql://root:12344321@localhost:3306/ptbaru'  ##ga bisa kalau 
# engine = sqlac.create_engine('mysql://root:12344321@localhost:3306/ptbaru') ##untuk sqlalchemy
# df1 = pd.read_sql_table('employees', engine, columns=['nama'])#baca tabel
# df2 = pd.read_sql('select nama, waktu from employees', engine )
# df = pd.read_sql(query, engine) #Ga bisa kalau ga pakai package *dbku
df = pd.read_sql(query, dbku)
df
# df.dtypes

   id     nama               email               waktu
0   1   Asnawi  asnawi@yahoo.co.id 2019-12-09 09:43:59
1   2    Bagas   bagasadi@yahoo.id 2019-12-09 09:43:59
2   3     Evan     evandd@yahoo.id 2019-12-09 09:43:59
3   4  Osvaldo    osvaldo@yahoo.id 2019-12-09 09:43:59

export to my sql

In [17]:
# df.to_sql(
# name = 'superheroes', #lowercase
# con = engine,
#     if_exist = 'replace' #'fail', 'append'
# )

In [18]:
# engine = sqlac.create_engine('mysql://root:12344321@localhost:3306/ptbaru') ##untuk sqlalchemy
newData = pd.DataFrame([{'id': 5, 'nama': 'Saddil',
                       'email': 'saddil@gmail.com',
                       'waktu': '2019-12-10 10:31:29'}])


dfx = pd.read_sql_query(
'select * from employees', dbku,
    parse_dates = ['waktu'],
    index_col = 'waktu')
dfx

# dfa = pd.concat([dfx.2, newData], ignore_index=True)
# dfa
newData['waktu'] = pd.to_datetime(newData['waktu'])
dfa = pd.concat([dfx, newData], ignore_index=True, sort=False)
dfa
# newData ['waktu'] = newData['waktu'].astype('datetime64')
dfa

   id     nama               email               waktu
0   1   Asnawi  asnawi@yahoo.co.id                 NaT
1   2    Bagas   bagasadi@yahoo.id                 NaT
2   3     Evan     evandd@yahoo.id                 NaT
3   4  Osvaldo    osvaldo@yahoo.id                 NaT
4   5   Saddil    saddil@gmail.com 2019-12-10 10:31:29

In [19]:
# ## mengubah jadi datetime:
# newData['waktu'] = pd.to_datetime(newData['waktu']) ##supaya yang string jadi datetime
# newData = ['waktu'] = newData['waktu'].astype

In [20]:
# dfa.set_index('waktu', inplace=True)
# dfa = dfa.set_index('waktu')
# dfa   ## untuk jadiin waktu yang jadi timestamp